const convert_ = converter(/(\p{sc=Hebrew}|[\u05B0-\u05BC\u05C1\u05C2])+/ug, [
  [/([\u05B0-\u05BC]+)([\u05C1\u05C2])/g, "$2$1"],

  [/\u05E9\u05C1/g, "\uFB2A"],
  [/\u05E9\u05C2/g, "\uFB21"],

  [/בּ/g, "Ƀ"],//ƀ
  [/גּ/g, "Ꞓ"],//ꞓ
  [/דּ/g, "Đ"],//đ
  [/(כּ|ךּ|כּ)/g, "Ꝁ"],//ꝁ
  [/פּ/g, "Ᵽ"],//ᵽ
  [/תּ/g, "Ŧ"],//ŧ

  [/א/g, "A"],
  [/ב/g, "B"],
  [/ג/g, "C"],
  [/ד/g, "D"],
  [/ה/g, "E"],
  [/ו/g, "V"],
  [/ז/g, "Z"],
  [/ח/g, "H"],
  [/ט/g, "Ṭ"],//ṭ
  [/י/g, "J"],
  [/[כך]/g, "K"],
  [/ל/g, "L"],
  [/[מם]/g, "M"],
  [/[נן]/g, "N"],
  [/ס/g, "X"],
  [/ע/g, "O"],
  [/[פף]/g, "P"],
  [/[צץ]/g, "Ṣ"],//ṣ
  [/ק/g, "Q"],
  [/ר/g, "R"],
  [/\uFB2A/g, "Š"],//š
  [/\uFB2B/g, "Ŝ"],//ŝ
  [/ש/g, "S"],
  [/ת/g, "T"],

  [/\u05B0/g, "'"],
  [/\u05B1/g, "ĕ"],
  [/\u05B2/g, "ă"],
  [/\u05B3/g, "ŏ"],
  [/\u05B4/g, "i"],
  [/\u05B5/g, "ē"],
  [/\u05B6/g, "e"],//ė
  [/\u05B7/g, "a"],//ȧ
  [/\u05B8/g, "o"],//ȯ
  [/\u05B9/g, "ō"],
  [/\u05BB/g, "u"],
  [/\u05BC/g, "h"],
], true);

document.addEventListener('DOMContentLoaded', () => {
  const trs = document.querySelectorAll('table tr');
  ['א', 'ב', 'בּ', 'ג', 'גּ', 'ד', 'דּ', 'ה', 'ו', 'ז', 'ח', 'ט', 'י', 'כ', 'כּ', 'ל', 'מ', 'נ', 'ס', 'ע', 'פ', 'פּ', 'צ', 'ק', 'ר', 'ש', 'שׁ', 'שׂ', 'ת', 'תּ',]
    .forEach((x) => {
      x = x.normalize('NFC');
      trs[0].innerHTML += `<td>${x}</td>`;
      trs[1].innerHTML += `<td>${convert_(x)}</td>`;
    })
});
