const convert_ = converter(/\p{sc=Hebrew}+/ug, [
  [/בּ/g, "ƀ"],
  [/גּ/g, "ꞓ"],
  [/דּ/g, "đ"],
  [/(כּ|ךּ|כּ)/g, "ꝁ"],
  [/פּ/g, "ᵽ"],
  [/תּ/g, "ŧ"],

  [/א/g, "a"],
  [/ב/g, "b"],
  [/ג/g, "c"],
  [/ד/g, "d"],
  [/ה/g, "e"],
  [/ו/g, "v"],
  [/ז/g, "z"],
  [/ח/g, "h"],
  [/ט/g, "ṭ"],
  [/י/g, "j"],
  [/[כך]/g, "k"],
  [/ל/g, "l"],
  [/[מם]/g, "m"],
  [/[נן]/g, "n"],
  [/ס/g, "x"],
  [/ע/g, "o"],
  [/[פף]/g, "p"],
  [/[צץ]/g, "ṣ"],
  [/ק/g, "q"],
  [/ר/g, "r"],
  [/שׁ|\u05E9\u05C1/g, "š"],
  [/שׂ|\u05E9\u05C2/g, "ŝ"],
  [/ש/g, "s"],
  [/ת/g, "t"],

  [/\u05B0/g, "'"],
  [/\u05B1/g, "ĕ"],
  [/\u05B2/g, "ă"],
  [/\u05B3/g, "ŏ"],
  [/\u05B4/g, "i"],
  [/\u05B5/g, "ē"],
  [/\u05B6/g, "ė"],
  [/\u05B7/g, "ȧ"],
  [/\u05B8/g, "ȯ"],
  [/\u05B9/g, "ō"],
  [/\u05BB/g, "u"],
  [/\u05BC/g, "h"],
]);

document.addEventListener('DOMContentLoaded', () => {
  const trs = document.querySelectorAll('table tr');
  ['א', 'ב', 'ג', 'ד', 'ה', 'ו', 'ז', 'ח', 'ט', 'י', 'כ', 'ל', 'מ', 'נ', 'ס', 'ע', 'פ', 'צ', 'ק', 'ר', 'ש', 'שׁ', 'שׂ', 'ת', 'בּ', 'גּ', 'דּ', 'כּ', 'פּ', 'תּ',]
    .forEach((x) => {
      x = x.normalize('NFC');
      trs[0].innerHTML += `<td>${x}</td>`;
      trs[1].innerHTML += `<td>${convert_(x)}</td>`;
    })
});
