const convert_ = converter(/(\p{L}|[،\u0654\u0652])+/ug, [
  [/أ/g, 'â'],
  [/ئ/g, 'î'],
  [/ؤ/g, 'û'],

  [/آ/g, 'а̄'],
  [/^ا/g, 'a'],
  [/ا/g, 'а̄'],
  [/ی/g, 'i'],
  [/و/g, 'u'],

  [/\u064E/g, 'a'],
  [/\u0650/g, 'e'],
  [/\u064F/g, 'o'],

  [/ء/g, "'"],
  [/\u0654/g, "'"],

  [/ن/g, 'n'],
  [/م/g, 'm'],
  [/ل/g, 'l'],
  [/ر/g, 'r'],

  [/پ/g, 'p'],
  [/ب/g, 'b'],
  [/ف/g, 'f'],

  [/ک/g, 'k'],
  [/گ/g, 'c'],
  [/خ/g, 'x'],
  [/غ/g, 'h'],

  [/ت/g, 't'],
  [/د/g, 'd'],
  [/ث/g, 'ţ'],
  [/ذ/g, 'ḑ'],
  [/س/g, 's'],
  [/ز/g, 'z'],

  [/چ/g, 'ť'],
  [/ج/g, 'ď'],
  [/ش/g, 'š'],
  [/ژ/g, 'ž'],

  [/ق/g, 'ḳ'],
  [/ط/g, 'ṭ'],
  [/ض/g, 'ḍ'],
  [/ص/g, 'ṣ'],
  [/ظ/g, 'ẓ'],

  [/ه/g, 'q'],
  [/ح/g, 'g'],
  [/ع/g, "'"],

  [/\u0652/g, ''],
  [/(.)\u0651/g, '$1$1'],
  [/،/g, ','],
]);

document.addEventListener('DOMContentLoaded', () => {
  const trs = document.querySelectorAll('table tr');
  'ی ه و ن م ل گ ک ق ف غ ع ظ ط ض ص ش س ژ ز ر ذ د خ ح چ ج ث ت پ ب ا ء'.split(' ')
    .forEach((x) => {
      trs[0].innerHTML += `<td>${x}</td>`;
      trs[1].innerHTML += `<td>${convert_(x)}</td>`;
    })
});
