verbose = false

const convert = (s, mode) =>
  [
    [/अ/g, "a"],
    [/इ|\u093F/g, "i"],
    [/ऋ|\u0943/g, "r"],
    [/ऌ|\u0962/g, "l"],
    [/उ|\u0941/g, "u"],

    [/आ|\u093E/g, ["ā", "A", "aa"]],
    [/ई|\u0940/g, ["ī", "I", "ii"]],
    [/ॠ|\u0943/g, ["r̄", "R", "rr"]],
    [/ॡ|\u0963/g, ["l̄", "L", "ll"]],
    [/ऊ|\u0942/g, ["ū", "U", "uu"]],

    [/ए|\u0947/g, "e"],
    [/ओ|\u094B/g, "o"],

    [/ऐ|\u0948/g, ["ai", "E", "ai"]],
    [/औ|\u094C/g, ["au", "O", "au"]],

    [/(?<=[कचटतपखछठथफगजडदबघझढधभङञणनमशषसहयरलव])(?![\u094DiīIeēEaāAoōOuūUr̄Rl̄L])/g, "a"],

    [/क/g, "k"],
    [/च/g, ["ḳ", "K", "kz"]],
    [/ट/g, ["ṫ", "T", "tz"]],
    [/त/g, "t"],
    [/प/g, "p"],

    [/ख/g, ["kh", "kh", "kh"]],
    [/छ/g, ["ḳh", "Kh", "kzh"]],
    [/ठ/g, ["ṫh", "Th", "tzh"]],
    [/थ/g, ["th", "th", "th"]],
    [/फ/g, ["ph", "ph", "ph"]],

    [/ग/g, "c"],
    [/ज/g, ["ċ", "C", "cz"]],
    [/ड/g, ["ḍ", "D", "dz"]],
    [/द/g, "d"],
    [/ब/g, "b"],

    [/घ/g, ["ch", "ch", "ch"]],
    [/झ/g, ["ċh", "Ch", "czh"]],
    [/ढ/g, ["ḍh", "Dh", "dzh"]],
    [/ध/g, ["dh", "dh", "dh"]],
    [/भ/g, ["bh", "bh", "bh"]],

    [/ङ/g, verbose ? ["g", "g", "g"] : "n"],
    [/ञ/g, verbose ? ["ġ", "G", "gz"] : "n"],
    [/ण/g, ["ṅ", "N", "nz"]],
    [/न/g, "n"],
    [/म/g, "m"],
    [/\u0902/g, "q"], // anusvaara ं

    [/\u0903/g, "x"], // visarga ः
    [/श/g, ["ẋ", "X", "xz"]],
    [/ष/g, ["ṡ", "S", "sz"]],
    [/स/g, "s"],

    [/ह/g, "h"],
    [/य/g, "j"],
    [/र/g, "y"],
    [/ल/g, "w"],
    [/व/g, "v"],

    [/ऽ/g, "-"],

    [/०/g, "0"],
    [/१/g, "1"],
    [/२/g, "2"],
    [/३/g, "3"],
    [/४/g, "4"],
    [/५/g, "5"],
    [/६/g, "6"],
    [/७/g, "7"],
    [/८/g, "8"],
    [/९/g, "9"],

    [/\u094D/g, ""],

    [/y/g, mode === 0 ? "ṙ" : "y"],
    [/w/g, mode === 0 ? "ḷ" : "w"],
    [/(?<=[iīIeēEaāAoōOuūUṙRḷL])ṙ(?=[iīIeēEaāAoōOuūUṙRḷL])/g, "r"],
    [/(?<=[iīIeēEaāAoōOuūUṙRḷL])ḷ(?=[iīIeēEaāAoōOuūUṙRḷL])/g, "l"],
    [/(?<![a-zA-Zīēāōūṙḷḳċġẋṫḍṅṡ])ṙ(?=[iīIeēEaāAoōOuūUr̄Rl̄L])/g, "r"],
    [/(?<![a-zA-Zīēāōūṙḷḳċġẋṫḍṅṡ])ḷ(?=[iīIeēEaāAoōOuūUr̄Rl̄L])/g, "l"],

    [/(.)z\1z/g, "$1$1z"],

    [/\u0930/g, "\u0307"], // nuktaa ़
    [/।/g, ","],
    [/॥/g, "."],
    [/॰/g, "'"],

  ]
    .map(([x, y]) =>
      [x, (Array.isArray(y) ? y : [y, y, y])[mode]]
    )
    .reduce((acc, [x, y]) => acc.replace(x, y), s.normalize("NFD"))
    .normalize("NFC")
