export default (s, up, cy) => {
  let r =
  [ /*[/dž/g, "џ"]
  ,*/ [/š/g, "ш"]
  ,	[/č/g, "ч"]
  , [/ž/g, "ж"]

  , [/ć/g, "щ"]
  , [/đ/g, "җ"]

  , [/ç/g, "ҟ"]
  , [/ʒ/g, "ғ"]

  , [/ť/g, "tь"]
  , [/ď/g, "dь"]
  , [/ś/g, "sь"]
  , [/ź/g, "zь"]
  , [/ň/g, "nь"]
  , [/ř/g, "rь"]
  , [/ľ/g, "lь"]
  , [/\u0301/g, "ь"]

  , [/ṱ/g, "t\u0306"]
  , [/ḓ/g, "d\u0306"]

  //\u0304
  , [/ṙ/g, "r\u0304"]
  , [/ŕ/g, "r\u0304ь"]
  , [/ŀ/g, "l\u0304"]
  , [/ĺ/g, "l\u0304ь"]

  , [/ě/g, "ѣ"]
  , [/ę/g, "ѧ"]
  , [/ų/g, "ѫ"]

  , [/è/g, "ь\u0304"]
  , [/ò/g, "ъ"]

  , [/ò/g, "ъ"]
  , [/ò/g, "ъ"]

  , [/ı/g, "ь\u0307"]

  , [/ė/g, "e\u0307"]
  , [/å/g, "o\u0307"]

  , [/ý/g, "-y"]
  , [/í/g, "-i"]
  , [/á/g, "-a"]
  , [/é/g, "-e"]
  , [/ì/g, "=i"]

  , [/œ/g, "ө"]

  , [/ĵ/g, "и\u0311"]

  , [/ď/g, "dь"]
  , [/ś/g, "sь"]
  , [/ź/g, "zь"]
  , [/ń/g, "nь"]
  , [/ŕ/g, "rь"]
  , [/ľ/g, "lь"]
  , [/(?<=[pbfvmtdszcnrlkgh])j/g, "ь"]
  , [/ji/g, "i"]
  , [/j/g, "й"]

  , [/k/g, "к"]
  , [/g/g, "г"]
  , [/h/g, "х"]
  , [/q/g, "ҁ"]

  //, [/dz/g, "ѕ"]
  , [/t/g, "т"]
  , [/d/g, "д"]
  , [/s/g, "с"]
  , [/z/g, "з"]
  , [/c/g, "ц"]

  , [/n/g, "н"]
  , [/r/g, "р"]
  , [/l/g, "л"]

  , [/p/g, "п"]
  , [/b/g, "б"]
  , [/f/g, "ф"]
  , [/v/g, "в"]
  , [/m/g, "м"]
  , [/ù|w/g, "ў"]

  , [/y/g, "ꙑ"] //ꙑъ
  , [/i/g, "и"] //иꙇі
  , [/a/g, "а"]
  , [/e/g, "є"] //єе
  , [/o/g, "о"]
  , [/u/g, "у"]

  , [/и(?!\u0311)/g, "ꙇ"]
  , [/ꙑ/g, "и"] 
  , [/[ьй]а/g, "ꙗ"]
  , [/[ьй]є/g, "ѥ"]
  , [/[ьй]о/g, "ю"]
  , [/[ьй]у/g, "ѵ"]
  , [/[ьй]ѧ/g, "ѩ"]
  , [/[ьй]ѫ/g, "ѭ"]
  ]
  .reduce((acc, [x, y]) => acc.replace(x, y), s.toLowerCase())
  .normalize("NFC")

  if(up)
    r = r.toUpperCase()

  return r
}
