export default (s, up, cy) => {
  let r =
  [ [/dž/g, "џ"]
  , [/š/g, "ш"]
  ,	[/č/g, "ч"]
  , [/ž/g, "ж"]

  , [/ć/g, "t\u0307"] //ҭ
  , [/đ/g, "d\u0307"]

  , [/ç/g, "k\u0307"] //ҟќ
  , [/ʒ/g, "g\u0307"] //ғѓ

  , [/ṱ/g, "t\u0306"]
  , [/ḓ/g, "d\u0306"]

  , [/ṙ/g, "r\u0304ь"]
  , [/ŕ/g, "r\u0304ь"]
  , [/ŀ/g, "l\u0304ь"]
  , [/ĺ/g, "l\u0304ь"]

  , [/ę/g, "ѧ"]
  , [/ų/g, "ѫ"]
  , [/ě/g, "ѣ"]

  , [/è/g, "ь\u0304"]
  , [/ò/g, "ъ\u0304"]

  , [/ıj/g, "ь\u0307"]

  , [/ė/g, "e\u0307"]
  , [/å/g, "o\u0307"]

  , [/ý/g, ".y"]
  , [/í/g, ".i"]
  , [/á/g, ".a"]
  , [/é/g, ".e"]
  , [/ì/g, "'i"]

  , [/œ/g, "o\u0308"]

  , [/ĵ/g, "j\u0307"]

  , [/ť/g, "tь"]
  , [/ď/g, "dь"]
  , [/ś/g, "sь"]
  , [/ź/g, "zь"]
  , [/ń/g, "nь"]
  , [/ŕ/g, "rь"]
  , [/ľ/g, "lь"]

  , [/k/g, "к"]
  , [/g/g, "г"]
  , [/h/g, "х"]

  , [/t/g, "т"]
  , [/d/g, "д"]
  , [/s/g, "с"]
  , [/z/g, "з"]
  , [/c/g, "ц"]
  , [/dz/g, "ѕ"]

  , [/n/g, "н"]
  , [/r/g, "р"]
  , [/l/g, "л"]

  , [/p/g, "п"]
  , [/b/g, "б"]
  , [/f/g, "ф"]
  , [/v/g, "в"]
  , [/m/g, "м"]
  , [/ù/g, "ў"]

  , [/(?<![tdsznrl])j(?=[ieaouѧѫ])/g, "ь"]
  , [/ď/g, "dь"]
  , [/ś/g, "sь"]
  , [/ź/g, "zь"]
  , [/ń/g, "nь"]
  , [/ŕ/g, "rь"]
  , [/ľ/g, "lь"]

  , [/j/g, "й"]

  //, [/ьy/g, "и"]
  //, [/ьi/g, "і"]
  , [/ьa/g, "ꙗ"]
  , [/ьe/g, "ѥ"]
  , [/ьo/g, "е"]
  , [/ьu/g, "ю"]
  , [/ьѧ/g, "ѩ"]
  , [/ьѫ/g, "ѭ"]

  , [/y/g, "и"]
  , [/i/g, "ꙇ"]
  , [/a/g, "а"]
  , [/e/g, "є"]
  , [/o/g, "о"]
  , [/u/g, "у"]
  ]
  .reduce((acc, [x, y]) => acc.replace(x, y), s.toLowerCase())
  .normalize("NFC")

  if(up)
    r = r.toUpperCase()

  return r
}
